anthropic.claude-code
dnut.rewrap-revived
dracula-theme.theme-dracula
eamodio.gitlens
forevolve.git-extensions-for-vs-code
github.vscode-pull-request-github
jebbs.plantuml
johnpapa.vscode-peacock
linda-cheung.content-menu-item-refresh
marclipovsky.string-manipulation
mathiasfrohlich.kotlin
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode.cmake-tools
ms-vscode.cpp-devtools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.powershell
openai.chatgpt
peakchen90.open-html-in-browser
ritwickdey.liveserver
tomoki1207.pdf
twxs.cmake
wraith13.zoombar-vscode
xaver.clang-format
